TexasInstruments/mspm0-sdk/examples/nortos/LP_MSPM0G3507/msp_subsystems/two_opa_instrumentation_amplifier/ti_msp_dl_config.h
/*
 * Copyright (c) 2023, Texas Instruments Incorporated - http://www.ti.com
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * *  Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 *
 * *  Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in the
 *    documentation and/or other materials provided with the distribution.
 *
 * *  Neither the name of Texas Instruments Incorporated nor the names of
 *    its contributors may be used to endorse or promote products derived
 *    from this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO,
 * THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
 * PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR
 * CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,
 * EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO,
 * PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS;
 * OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
 * WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR
 * OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
 * EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */

/*
 *  ============ ti_msp_dl_config.h =============
 *  Configured MSPM0 DriverLib module declarations
 *
 *  DO NOT EDIT - This file is generated for the LP_MSPM0G3507
 *  by the SysConfig tool.
 */
#ifndef ti_msp_dl_config_h
#define ti_msp_dl_config_h

#define CONFIG_LP_MSPM0G3507
#define CONFIG_MSPM0G3507

#if defined(__ti_version__) || defined(__TI_COMPILER_VERSION__)
#define SYSCONFIG_WEAK __attribute__((weak))
#elif defined(__IAR_SYSTEMS_ICC__)
#define SYSCONFIG_WEAK __weak
#elif defined(__GNUC__)
#define SYSCONFIG_WEAK __attribute__((weak))
#endif

#include <ti/devices/msp/msp.h>
#include <ti/driverlib/driverlib.h>
#include <ti/driverlib/m0p/dl_core.h>

#ifdef __cplusplus
extern "C" {
#endif

/*
 *  ======== SYSCFG_DL_init ========
 *  Perform all required MSP DL initialization
 *
 *  This function should be called once at a point before any use of
 *  MSP DL.
 */


/* clang-format off */

#define POWER_STARTUP_DELAY                                                (16)


#define CPUCLK_FREQ                                                     32000000



/* Defines for TIMER0 */
#define TIMER0_INST                                                      (TIMG0)
#define TIMER0_INST_IRQHandler                                  TIMG0_IRQHandler
#define TIMER0_INST_INT_IRQN                                    (TIMG0_INT_IRQn)
#define TIMER0_INST_LOAD_VALUE                                             (32U)
#define TIMER0_INST_PUB_0_CH                                                 (1)




/* Defines for ADC */
#define ADC_INST                                                            ADC1
#define ADC_INST_IRQHandler                                      ADC1_IRQHandler
#define ADC_INST_INT_IRQN                                        (ADC1_INT_IRQn)
#define ADC_ADCMEM_0                                          DL_ADC12_MEM_IDX_0
#define ADC_ADCMEM_0_REF                         DL_ADC12_REFERENCE_VOLTAGE_VDDA
#define ADC_ADCMEM_0_REF_VOLTAGE_V                                           3.3
#define ADC_INST_SUB_CH                                                      (1)


/* Defines for OPA_0 */
#define OPA_0_INST                                                          OPA0
#define GPIO_OPA_0_IN0POS_PORT                                             GPIOA
#define GPIO_OPA_0_IN0POS_PIN                                     DL_GPIO_PIN_26
#define GPIO_OPA_0_IOMUX_IN0POS                                  (IOMUX_PINCM59)
#define GPIO_OPA_0_IOMUX_IN0POS_FUNC                IOMUX_PINCM59_PF_UNCONNECTED
#define GPIO_OPA_0_IN0NEG_PORT                                             GPIOA
#define GPIO_OPA_0_IN0NEG_PIN                                     DL_GPIO_PIN_27
#define GPIO_OPA_0_IOMUX_IN0NEG                                  (IOMUX_PINCM60)
#define GPIO_OPA_0_IOMUX_IN0NEG_FUNC                IOMUX_PINCM60_PF_UNCONNECTED
#define GPIO_OPA_0_OUT_PORT                                                GPIOA
#define GPIO_OPA_0_OUT_PIN                                        DL_GPIO_PIN_22
#define GPIO_OPA_0_IOMUX_OUT                                     (IOMUX_PINCM47)
#define GPIO_OPA_0_IOMUX_OUT_FUNC                   IOMUX_PINCM47_PF_UNCONNECTED
/* Defines for OPA_1 */
#define OPA_1_INST                                                          OPA1
#define GPIO_OPA_1_IN0POS_PORT                                             GPIOB
#define GPIO_OPA_1_IN0POS_PIN                                     DL_GPIO_PIN_19
#define GPIO_OPA_1_IOMUX_IN0POS                                  (IOMUX_PINCM45)
#define GPIO_OPA_1_IOMUX_IN0POS_FUNC                IOMUX_PINCM45_PF_UNCONNECTED
#define GPIO_OPA_1_IN0NEG_PORT                                             GPIOB
#define GPIO_OPA_1_IN0NEG_PIN                                     DL_GPIO_PIN_20
#define GPIO_OPA_1_IOMUX_IN0NEG                                  (IOMUX_PINCM48)
#define GPIO_OPA_1_IOMUX_IN0NEG_FUNC                IOMUX_PINCM48_PF_UNCONNECTED
#define GPIO_OPA_1_OUT_PORT                                                GPIOA
#define GPIO_OPA_1_OUT_PIN                                        DL_GPIO_PIN_16
#define GPIO_OPA_1_IOMUX_OUT                                     (IOMUX_PINCM38)
#define GPIO_OPA_1_IOMUX_OUT_FUNC                   IOMUX_PINCM38_PF_UNCONNECTED


/* clang-format on */

void SYSCFG_DL_init(void);
void SYSCFG_DL_initPower(void);
void SYSCFG_DL_GPIO_init(void);
void SYSCFG_DL_SYSCTL_init(void);
void SYSCFG_DL_TIMER0_init(void);
void SYSCFG_DL_ADC_init(void);
void SYSCFG_DL_OPA_0_init(void);
void SYSCFG_DL_OPA_1_init(void);

bool SYSCFG_DL_saveConfiguration(void);
bool SYSCFG_DL_restoreConfiguration(void);

#ifdef __cplusplus
}
#endif

#endif /* ti_msp_dl_config_h */
